xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_tim2.c
/**
  ******************************************************************************
  * @file stm8_tim2.c
  * @brief This file contains all the functions for the TIM2 peripheral.
  * @author STMicroelectronics
  * @version V0.04
  * @date 21-DEC-2007
  ******************************************************************************
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH SOFTWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2007 STMicroelectronics</center></h2>
  * @image html logo.bmp
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm8_tim2.h"

/* LINKER SECTIONS DEFINITION FOR THIS FILE ONLY */
#ifdef USE_COSMIC_SECTIONS
#pragma section (TIM2_CODE)
#pragma section const {TIM2_CONST}
#pragma section @near [TIM2_URAM]
#pragma section @near {TIM2_IRAM}
#pragma section @tiny [TIM2_UZRAM]
#pragma section @tiny {TIM2_IZRAM}
#endif

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/* TIM2 private Masks */
#define TIM2_PERIOD_RESET_MASK             ((u16)0xFFFF)
#define TIM2_PRESCALER_RESET_MASK          ((u8)0x00)
#define TIM2_PULSE_RESET_MASK              ((u16)0x0000)
#define TIM2_ICFILTER_MASK                 ((u8)0x00)


/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
static void TI1_Config(u8 TIM2_ICPolarity, u8 TIM2_ICSelection,
                       u8 TIM2_ICFilter);
static void TI2_Config(u8 TIM2_ICPolarity, u8 TIM2_ICSelection,
                       u8 TIM2_ICFilter);
static void TI3_Config(u8 TIM2_ICPolarity, u8 TIM2_ICSelection,
                       u8 TIM2_ICFilter);
/**
  * @addtogroup TIM2_Public_Functions
  * @{
  */

/**
  * @brief Deinitializes the TIM2 peripheral registers to their default reset values.
  * @param[in] :
  * None
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Initialize TIM2 registers to their reset values.
  * @code
  * TIM2_DeInit();
  * @endcode
  */
void TIM2_DeInit(void)
{

    TIM2->CR1 = (u8)TIM2_CR1_RESET_VALUE;
    TIM2->IER = (u8)TIM2_IER_RESET_VALUE;
    TIM2->SR2 = (u8)TIM2_SR2_RESET_VALUE;

    /* Disable channels */
    TIM2->CCER1 = (u8)TIM2_CCER1_RESET_VALUE;
    TIM2->CCER2 = (u8)TIM2_CCER2_RESET_VALUE;


    /* Then reset channel registers: it also works if lock level is equal to 2 or 3 */
    TIM2->CCER1 = (u8)TIM2_CCER1_RESET_VALUE;
    TIM2->CCER2 = (u8)TIM2_CCER2_RESET_VALUE;
    TIM2->CCMR1 = (u8)TIM2_CCMR1_RESET_VALUE;
    TIM2->CCMR2 = (u8)TIM2_CCMR2_RESET_VALUE;
    TIM2->CCMR3 = (u8)TIM2_CCMR3_RESET_VALUE;
    TIM2->CNTRH = (u8)TIM2_CNTRH_RESET_VALUE;
    TIM2->CNTRL = (u8)TIM2_CNTRL_RESET_VALUE;
    TIM2->PSCR	= (u8)TIM2_PSCR_RESET_VALUE;
    TIM2->ARRH 	= (u8)TIM2_ARRH_RESET_VALUE;
    TIM2->ARRL 	= (u8)TIM2_ARRL_RESET_VALUE;
    TIM2->CCR1H = (u8)TIM2_CCR1H_RESET_VALUE;
    TIM2->CCR1L = (u8)TIM2_CCR1L_RESET_VALUE;
    TIM2->CCR2H = (u8)TIM2_CCR2H_RESET_VALUE;
    TIM2->CCR2L = (u8)TIM2_CCR2L_RESET_VALUE;
    TIM2->CCR3H = (u8)TIM2_CCR3H_RESET_VALUE;
    TIM2->CCR3L = (u8)TIM2_CCR3L_RESET_VALUE;
    TIM2->SR1 = (u8)TIM2_SR1_RESET_VALUE;
}


/**
  * @brief Initializes the TIM2 Time Base Unit according to the specified
  * parameters in the TIM2_TimeBaseInitStruct.
  * @param[in] TIM2_TimeBaseInitStruct pointer to a TIM2_TimeBaseInit_TypeDef
  * structure that contains the configuration information for the specified
  * TIM2 peripheral.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Initialize TIM2 registers to the values on TIM2_TimeBaseInitStruct.
  * @code
  * TIM2_TimeBaseInit(&TIM2_TimeBaseInitStruct);
  * @endcode
  */
void TIM2_TimeBaseInit(TIM2_TimeBaseInit_TypeDef* TIM2_TimeBaseInitStruct)
{
    /* Set the Autoreload value */
    TIM2->ARRH = (u8)(TIM2_TimeBaseInitStruct->TIM2_Period >> 8) ;
	TIM2->ARRL = (u8)(TIM2_TimeBaseInitStruct->TIM2_Period);
    
    /* Set the Prescaler value */
    TIM2->PSCR = (u8)(TIM2_TimeBaseInitStruct->TIM2_Prescaler);
}


/**
  * @brief Initializes the TIM2 Channel1 according to the specified parameters
  * in the TIM2_OCInitStruct.
  * @param[in] TIM2_OCInitStruct pointer to a TIM2_OCInit_TypeDef structure that
  * contains the configuration information for the TIM2 peripheral.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Initialize the TIM2 Channel1 according to the specified parameters in the
  * TIM2_OCInitStruct.
  * @code
  * TIM2_OC1Init(&TIM2_OCInitStruct);
  * @endcode
  */
void TIM2_OC1Init(TIM2_OCInit_TypeDef* TIM2_OCInitStruct)
{
    u8 tmpccmr1 = 0;


    /* Check the parameters */
    assert_param(IS_TIM2_OC_MODE_OK(TIM2_OCInitStruct->TIM2_OCMode));
    assert_param(IS_TIM2_OUTPUT_STATE_OK(TIM2_OCInitStruct->TIM2_OutputState));
    assert_param(IS_TIM2_OC_POLARITY_OK(TIM2_OCInitStruct->TIM2_OCPolarity));


    tmpccmr1 = TIM2->CCMR1;


    /* Disable the Channel 1: Reset the CCE Bit */
    TIM2->CCER1 &= (u8)(~TIM2_CCER1_CC1E);
    /* Reset the Output Compare Bits */
    tmpccmr1 &= (u8)(~TIM2_CCMR_OCM);

    /* Set the Ouput Compare Mode */
    tmpccmr1 |= (u8)TIM2_OCInitStruct->TIM2_OCMode;

    TIM2->CCMR1 = tmpccmr1;

    /* Set the Output State */
    if (TIM2_OCInitStruct->TIM2_OutputState == TIM2_OUTPUTSTATE_ENABLE)
    {
        TIM2->CCER1 |= TIM2_CCER1_CC1E;
    }
    else
    {
        TIM2->CCER1 &= (u8)(~TIM2_CCER1_CC1E);
    }


    /* Set the Output Polarity */
    if (TIM2_OCInitStruct->TIM2_OCPolarity == TIM2_OCPOLARITY_LOW)
    {
        TIM2->CCER1 |= TIM2_CCER1_CC1P;
    }
    else
    {
        TIM2->CCER1 &= (u8)(~TIM2_CCER1_CC1P);
    }

    /* Set the Pulse value */
    TIM2->CCR1H = (u8)(TIM2_OCInitStruct->TIM2_Pulse >> 8);
	TIM2->CCR1L = (u8)(TIM2_OCInitStruct->TIM2_Pulse);
    
