xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_tim2.c
}


/**
  * @brief Initializes the TIM2 Channel2 according to the specified
  * parameters in the TIM2_OCInitStruct.
  * @param[in] TIM2_OCInitStruct pointer to a TIM2_OCInit_TypeDef structure that
  * contains the configuration information for the TIM2 peripheral.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Initialize the TIM2 Channel2 according to the specified parameters in the
  * TIM2_OCInitStruct.
  * @code
  * TIM2_OC2Init(&TIM2_OCInitStruct);
  * @endcode
  */
void TIM2_OC2Init(TIM2_OCInit_TypeDef* TIM2_OCInitStruct)
{
    u8 tmpccmr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM2_OC_MODE_OK(TIM2_OCInitStruct->TIM2_OCMode));
    assert_param(IS_TIM2_OUTPUT_STATE_OK(TIM2_OCInitStruct->TIM2_OutputState));
    assert_param(IS_TIM2_OC_POLARITY_OK(TIM2_OCInitStruct->TIM2_OCPolarity));

    tmpccmr2 = TIM2->CCMR2;

    /* Disable the Channel 2: Reset the CCE Bit */
    TIM2->CCER1 &= (u8)(~TIM2_CCER1_CC2E);

    /* Reset the Output Compare Bits */
    tmpccmr2 &= (u8)(~TIM2_CCMR_OCM);

    /* Set the Ouput Compare Mode */
    tmpccmr2 |= TIM2_OCInitStruct->TIM2_OCMode;

    TIM2->CCMR2 = tmpccmr2;

    /* Set the Output State */
    if (TIM2_OCInitStruct->TIM2_OutputState == TIM2_OUTPUTSTATE_ENABLE)
    {
        TIM2->CCER1 |= TIM2_CCER1_CC2E;
    }
    else
    {
        TIM2->CCER1 &= (u8)(~TIM2_CCER1_CC2E);
    }



    /* Set the Output Polarity */
    if (TIM2_OCInitStruct->TIM2_OCPolarity == TIM2_OCPOLARITY_LOW)
    {
        TIM2->CCER1 |= TIM2_CCER1_CC2P;
    }
    else
    {
        TIM2->CCER1 &= (u8)(~TIM2_CCER1_CC2P);
    }


    /* Set the Pulse value */
    TIM2->CCR2H = (u8)(TIM2_OCInitStruct->TIM2_Pulse >> 8);
	TIM2->CCR2L = (u8)(TIM2_OCInitStruct->TIM2_Pulse);
    
}


/**
  * @brief Initializes the TIM2 Channel3 according to the specified
  * parameters in the TIM2_OCInitStruct.
  * @param[in] TIM2_OCInitStruct pointer to a TIM2_OCInit_TypeDef structure that
  * contains the configuration information for the TIM2 peripheral.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Initialize the TIM2 Channel3 according to the specified parameters in the
  * TIM2_OCInitStruct.
  * @code
  * TIM2_OC3Init(&TIM2_OCInitStruct);
  * @endcode
  */
void TIM2_OC3Init(TIM2_OCInit_TypeDef* TIM2_OCInitStruct)
{
    u8 tmpccmr3 = 0;

    /* Check the parameters */
    assert_param(IS_TIM2_OC_MODE_OK(TIM2_OCInitStruct->TIM2_OCMode));
    assert_param(IS_TIM2_OUTPUT_STATE_OK(TIM2_OCInitStruct->TIM2_OutputState));
    assert_param(IS_TIM2_OC_POLARITY_OK(TIM2_OCInitStruct->TIM2_OCPolarity));

    tmpccmr3 = TIM2->CCMR3;

    /* Disable the Channel 3: Reset the CCE Bit */
    TIM2->CCER2 &= (u8)(~TIM2_CCER2_CC3E);

    /* Reset the Output Compare Bits */
    tmpccmr3 &= (u8)(~TIM2_CCMR_OCM);

    /* Set the Ouput Compare Mode */
    tmpccmr3 |= TIM2_OCInitStruct->TIM2_OCMode;

    TIM2->CCMR3 = tmpccmr3;

    /* Set the Output State */
    if (TIM2_OCInitStruct->TIM2_OutputState == TIM2_OUTPUTSTATE_ENABLE)
    {
        TIM2->CCER2 |= TIM2_CCER2_CC3E;
    }
    else
    {
        TIM2->CCER2 &= (u8)(~TIM2_CCER2_CC3E);
    }


    /* Set the Output Polarity */
    if (TIM2_OCInitStruct->TIM2_OCPolarity == TIM2_OCPOLARITY_LOW)
    {
        TIM2->CCER2 |= TIM2_CCER2_CC3P;
    }
    else
    {
        TIM2->CCER2 &= (u8)(~TIM2_CCER2_CC3P);
    }


    /* Set the Pulse value */
    TIM2->CCR3H = (u8)(TIM2_OCInitStruct->TIM2_Pulse >> 8);
	TIM2->CCR3L = (u8)(TIM2_OCInitStruct->TIM2_Pulse);
    
}


/**
  * @brief Initializes the TIM2 peripheral according to the specified parameters
  * in the TIM2_ICInitStruct.
  * @param[in] TIM2_ICInitStruct pointer to a TIM2_ICInit_TypeDef structure that
  * contains the configuration information for the TIM2 peripheral.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * TI1_Config
  * TI2_Config
  * TI3_Config
  * TIM2_SetIC1Prescaler
  * TIM2_SetIC2Prescaler
  * TIM2_SetIC3Prescaler
  * @par Example:
  * Initialize the TIM2 Channel1 according to the specified parameters in the
  * TIM2_ICInitStruct.
  * @code
  * TIM2_ICInit(&TIM2_ICInitStruct);
  * @endcode
  */
void TIM2_ICInit(TIM2_ICInit_TypeDef* TIM2_ICInitStruct)
{
    /* Check the parameters */
    assert_param(IS_TIM2_CHANNEL_OK(TIM2_ICInitStruct->TIM2_Channel));
    assert_param(IS_TIM2_IC_POLARITY_OK(TIM2_ICInitStruct->TIM2_ICPolarity));
    assert_param(IS_TIM2_IC_SELECTION_OK(TIM2_ICInitStruct->TIM2_ICSelection));
    assert_param(IS_TIM2_IC_PRESCALER_OK(TIM2_ICInitStruct->TIM2_ICPrescaler));
    assert_param(IS_TIM2_IC_FILTER_OK(TIM2_ICInitStruct->TIM2_ICFilter));

    if (TIM2_ICInitStruct->TIM2_Channel == TIM2_CHANNEL_1)
    {
        /* TI1 Configuration */
        TI1_Config(TIM2_ICInitStruct->TIM2_ICPolarity,
                   TIM2_ICInitStruct->TIM2_ICSelection,
                   TIM2_ICInitStruct->TIM2_ICFilter);

        /* Set the Input Capture Prescaler value */
        TIM2_SetIC1Prescaler(TIM2_ICInitStruct->TIM2_ICPrescaler);
    }
    else if (TIM2_ICInitStruct->TIM2_Channel == TIM2_CHANNEL_2)
    {
        /* TI2 Configuration */
        TI2_Config(TIM2_ICInitStruct->TIM2_ICPolarity,
                   TIM2_ICInitStruct->TIM2_ICSelection,
                   TIM2_ICInitStruct->TIM2_ICFilter);

        /* Set the Input Capture Prescaler value */
        TIM2_SetIC2Prescaler(TIM2_ICInitStruct->TIM2_ICPrescaler);
    }
    else
    {
        /* TI3 Configuration */
        TI3_Config(TIM2_ICInitStruct->TIM2_ICPolarity,
                   TIM2_ICInitStruct->TIM2_ICSelection,
                   TIM2_ICInitStruct->TIM2_ICFilter);

        /* Set the Input Capture Prescaler value */
        TIM2_SetIC3Prescaler(TIM2_ICInitStruct->TIM2_ICPrescaler);
    }
}


/**
  * @brief Configures the TIM2 peripheral in PWM Input Mode according to the
  * specified parameters in the TIM2_ICInitStruct.
  * @param[in] TIM2_ICInitStruct pointer to a TIM2_ICInit_TypeDef structure that
  * contains the configuration information for the TIM2 peripheral.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * TI1_Config
  * TI2_Config
  * TIM2_SetIC1Prescaler
  * TIM2_SetIC2Prescaler
  * @par Example:
  * Configure the TIM2 peripheral in PWM Input Mode according to the specified
  * parameters in the TIM2_ICInitStruct.
  * @code
  * TIM2_PWMIConfig(&TIM2_ICInitStruct);
  * @endcode
  */
void TIM2_PWMIConfig(TIM2_ICInit_TypeDef* TIM2_ICInitStruct)
{
    u8 icpolarity = (u8)TIM2_ICPOLARITY_RISING;
    u8 icselection = (u8)TIM2_ICSELECTION_DIRECTTI;

    /* Check the parameters */
    assert_param(IS_TIM2_PWMI_CHANNEL_OK(TIM2_ICInitStruct->TIM2_Channel));
    assert_param(IS_TIM2_IC_POLARITY_OK(TIM2_ICInitStruct->TIM2_ICPolarity));
    assert_param(IS_TIM2_IC_SELECTION_OK(TIM2_ICInitStruct->TIM2_ICSelection));
    assert_param(IS_TIM2_IC_PRESCALER_OK(TIM2_ICInitStruct->TIM2_ICPrescaler));

    /* Select the Opposite Input Polarity */
    if (TIM2_ICInitStruct->TIM2_ICPolarity == TIM2_ICPOLARITY_RISING)
    {
        icpolarity = (u8)TIM2_ICPOLARITY_FALLING;
    }
    else
    {
        icpolarity = (u8)TIM2_ICPOLARITY_RISING;
    }

