xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_tim2.c
    /* Select the Opposite Input */
    if (TIM2_ICInitStruct->TIM2_ICSelection == TIM2_ICSELECTION_DIRECTTI)
    {
        icselection = (u8)TIM2_ICSELECTION_INDIRECTTI;
    }
    else
    {
        icselection = (u8)TIM2_ICSELECTION_DIRECTTI;
    }

    if (TIM2_ICInitStruct->TIM2_Channel == TIM2_CHANNEL_1)
    {
        /* TI1 Configuration */
        TI1_Config(TIM2_ICInitStruct->TIM2_ICPolarity, TIM2_ICInitStruct->TIM2_ICSelection,
                   TIM2_ICInitStruct->TIM2_ICFilter);

        /* Set the Input Capture Prescaler value */
        TIM2_SetIC1Prescaler(TIM2_ICInitStruct->TIM2_ICPrescaler);

        /* TI2 Configuration */
        TI2_Config(icpolarity, icselection, TIM2_ICInitStruct->TIM2_ICFilter);

        /* Set the Input Capture Prescaler value */
        TIM2_SetIC2Prescaler(TIM2_ICInitStruct->TIM2_ICPrescaler);
    }
    else
    {
        /* TI2 Configuration */
        TI2_Config(TIM2_ICInitStruct->TIM2_ICPolarity, TIM2_ICInitStruct->TIM2_ICSelection,
                   TIM2_ICInitStruct->TIM2_ICFilter);

        /* Set the Input Capture Prescaler value */
        TIM2_SetIC2Prescaler(TIM2_ICInitStruct->TIM2_ICPrescaler);

        /* TI1 Configuration */
        TI1_Config(icpolarity, icselection, TIM2_ICInitStruct->TIM2_ICFilter);

        /* Set the Input Capture Prescaler value */
        TIM2_SetIC1Prescaler(TIM2_ICInitStruct->TIM2_ICPrescaler);
    }
}

/**
  * @brief Fills each TIM2_OCInitStruct member with its default value.
  * @param[in] TIM2_OCInitStruct pointer to a TIM2_OCInit_TypeDef structure which
  * will be initialized.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Fill each TIM2_OCInitStruct member with its default value.
  * @code
  * TIM2_OCStructInit(&TIM2_OCInitStruct);
  * @endcode
  */
void TIM2_OCStructInit(TIM2_OCInit_TypeDef* TIM2_OCInitStruct)
{
    /* Set the default configuration */
    TIM2_OCInitStruct->TIM2_OCMode = (u8)TIM2_OCMODE_TIMING;
    TIM2_OCInitStruct->TIM2_OutputState = (u8)TIM2_OUTPUTSTATE_DISABLE;
    TIM2_OCInitStruct->TIM2_Pulse = (u16)TIM2_PULSE_RESET_MASK;
    TIM2_OCInitStruct->TIM2_OCPolarity = (u8)TIM2_OCPOLARITY_HIGH;
}


/**
  * @brief Fills each TIM2_ICInitStruct member with its default value.
  * @param[in] TIM2_ICInitStruct pointer to a TIM2_ICInit_TypeDef structure which
  * will be initialized.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Fill each TIM2_ICInitStruct member with its default value.
  * @code
  * TIM2_ICStructInit(&TIM2_ICInitStruct);
  * @endcode
  */
void TIM2_ICStructInit(TIM2_ICInit_TypeDef* TIM2_ICInitStruct)
{
    /* Set the default configuration */
    TIM2_ICInitStruct->TIM2_Channel = (u8)TIM2_CHANNEL_1;
    TIM2_ICInitStruct->TIM2_ICSelection = (u8)TIM2_ICSELECTION_DIRECTTI;
    TIM2_ICInitStruct->TIM2_ICPolarity = (u8)TIM2_ICPOLARITY_RISING;
    TIM2_ICInitStruct->TIM2_ICPrescaler = (u8)TIM2_ICPSC_DIV1;
    TIM2_ICInitStruct->TIM2_ICFilter = (u8)TIM2_ICFILTER_MASK;
}


/**
  * @brief Fills each TIM2_TimeBaseInitStruct member with its default value.
  * @param[in] TIM2_TimeBaseInitStruct pointer to a TIM2_TimeBaseInit_TypeDef
  * structure which will be initialized.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Fill each TIM2_TimeBaseInitStruct member with its default value.
  * @code
  * TIM2_TimeBaseStructInit(&TIM2_TimeBaseInitStruct);
  * @endcode
  */
void TIM2_TimeBaseStructInit(TIM2_TimeBaseInit_TypeDef* TIM2_TimeBaseInitStruct)
{
    /* Set the default configuration */
    TIM2_TimeBaseInitStruct->TIM2_Period = (u16)TIM2_PERIOD_RESET_MASK;
    TIM2_TimeBaseInitStruct->TIM2_Prescaler = (u16) TIM2_PRESCALER_RESET_MASK;
}

/**
  * @brief Enables or disables the TIM2 peripheral.
  * @param[in] NewState new state of the TIM2 peripheral.This parameter can
  * be ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable the TIM2 peripheral.
  * @code
  * TIM2_Cmd(ENABLE);
  * @endcode
  */
void TIM2_Cmd(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONALSTATE_OK(NewState));

    /* set or Reset the CEN Bit */
    if (NewState == ENABLE)
    {
        TIM2->CR1 |= TIM2_CR1_CEN ;
    }
    else
    {
        TIM2->CR1 &= (u8)(~TIM2_CR1_CEN) ;
    }
}


/**
  * @brief Enables or disables the specified TIM2 interrupts.
  * @param[in] NewState new state of the TIM2 peripheral.
  * This parameter can be: ENABLE or DISABLE.
  * @param[in] TIM2_IT specifies the TIM2 interrupts sources to be enabled or disabled.
  * This parameter can be any combination of the following values:
  *                       - TIM2_IT_UPDATE: TIM2 update Interrupt source
  *                       - TIM2_IT_CC1: TIM2 Capture Compare 1 Interrupt source
  *                       - TIM2_IT_CC2: TIM2 Capture Compare 2 Interrupt source
  *                       - TIM2_IT_CC3: TIM2 Capture Compare 3 Interrupt source
  * @param[in] NewState new state of the TIM2 peripheral.

  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable the the TIM2_IT_UPDATE interrupt.
  * @code
  * TIM2_ITConfig(TIM2_IT_Update, ENABLE);
  * @endcode
  */
void TIM2_ITConfig(u8 TIM2_IT, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_TIM2_IT_OK(TIM2_IT));
    assert_param(IS_FUNCTIONALSTATE_OK(NewState));

    if (NewState == ENABLE)
    {
        /* Enable the Interrupt sources */
        TIM2->IER |= TIM2_IT;
    }
    else
    {
        /* Disable the Interrupt sources */
        TIM2->IER &= (u8)(~TIM2_IT);
    }
}


/**
  * @brief Enables or Disables the TIM2 Update event.
  * @param[in] NewState new state of the TIM2 peripheral Preload register.This parameter can
  * be ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable the TIM2 Update event.
  * @code
  * TIM2_UpdateDisableConfig(ENABLE);
  * @endcode
  */

void TIM2_UpdateDisableConfig(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONALSTATE_OK(NewState));

    /* Set or Reset the UDIS Bit */
    if (NewState == ENABLE)
    {
        TIM2->CR1 |= TIM2_CR1_UDIS ;
    }
    else
    {
        TIM2->CR1 &= (u8)(~TIM2_CR1_UDIS) ;
    }
}

/**
  * @brief Selects the TIM2 Update Request Interrupt source.
  * @param[in] TIM2_UpdateSource specifies the Update source.
  * This parameter can be one of the following values
  *                       - TIM2_UPDATESOURCE_REGULAR
  *                       - TIM2_UPDATESOURCE_GLOBAL
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Select the TIM2 Update Request Interrupt source
  * @code
  * TIM2_UpdateRequestConfig(TIM2_UPDATESOURCE_GLOBAL);
  * @endcode
  */
void TIM2_UpdateRequestConfig(u8 TIM2_UpdateSource)
{
    /* Check the parameters */
    assert_param(IS_TIM2_UPDATE_SOURCE_OK(TIM2_UpdateSource));

    /* Set or Reset the URS Bit */
    if (TIM2_UpdateSource == TIM2_UPDATESOURCE_REGULAR)
    {
        TIM2->CR1 |= TIM2_CR1_URS ;
    }
    else
    {
        TIM2->CR1 &= (u8)(~TIM2_CR1_URS) ;
    }
}


/**
  * @brief Selects the TIM2’s One Pulse Mode.
  * @param[in] TIM2_OPMode specifies the OPM Mode to be used.
  * This parameter can be one of the following values
  *                    - TIM2_OPMODE_SINGLE
  *                    - TIM2_OPMODE_REPETITIVE
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Select the TIM2 single One Pulse Mode
  * @code
  * TIM2_SelectOnePulseMode(TIM2_OPMODE_SINGLE);
  * @endcode
  */
void TIM2_SelectOnePulseMode(u8 TIM2_OPMode)
{
    /* Check the parameters */
    assert_param(IS_TIM2_OPM_MODE_OK(TIM2_OPMode));

    /* Set or Reset the OPM Bit */
    if (TIM2_OPMode == TIM2_OPMODE_SINGLE)
    {
        TIM2->CR1 |= TIM2_CR1_OPM ;
    }
    else
    {
        TIM2->CR1 &= (u8)(~TIM2_CR1_OPM) ;
    }

