xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_tim2.c
}


/**
  * @brief Configures the TIM2 Prescaler.
  * @param[in] Prescaler specifies the Prescaler Register value
  * This parameter can be one of the following values
  *                       -  TIM2_PRESCALER_1
  *                       -  TIM2_PRESCALER_2
  *                       -  TIM2_PRESCALER_4
  *                       -  TIM2_PRESCALER_8
  *                       -  TIM2_PRESCALER_16
  *                       -  TIM2_PRESCALER_32
  *                       -  TIM2_PRESCALER_64
  *                       -  TIM2_PRESCALER_128
  *                       -  TIM2_PRESCALER_256
  *                       -  TIM2_PRESCALER_512
  *                       -  TIM2_PRESCALER_1024
  *                       -  TIM2_PRESCALER_2048
  *                       -  TIM2_PRESCALER_4096
  *                       -  TIM2_PRESCALER_8192
  *                       -  TIM2_PRESCALER_16384
  *                       -  TIM2_PRESCALER_32768
  * @param[in] TIM2_PSCReloadMode specifies the TIM2 Prescaler Reload mode.
  * This parameter can be one of the following values
  *                       - TIM2_PSCRELOADMODE_IMMEDIATE: The Prescaler is loaded
  *                         immediatly.
  *                       - TIM2_PSCRELOADMODE_UPDATE: The Prescaler is loaded at
  *                         the update event.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Configures the TIM2 Prescaler.
  * @code
  * TIM2_PrescalerConfig(TIM2_PRESCALER_1, TIM2_PSCRELOADMODE_UPDATE);
  * @endcode
  */

void TIM2_PrescalerConfig(u8 Prescaler, u8 TIM2_PSCReloadMode)
{
    /* Check the parameters */
    assert_param(IS_TIM2_PRESCALER_RELOAD_OK(TIM2_PSCReloadMode));
    assert_param(IS_TIM2_PRESCALER_OK(Prescaler));

    /* Set the Prescaler value */
    TIM2->PSCR = Prescaler;

    /* Set or reset the UG Bit */
    if (TIM2_PSCReloadMode == TIM2_PSCRELOADMODE_IMMEDIATE)
    {
        TIM2->EGR |= TIM2_EGR_UG ;
    }
    else
    {
        TIM2->EGR &= (u8)(~TIM2_EGR_UG) ;
    }
}


/**
  * @brief Forces the TIM2 Channel1 output waveform to active or inactive level.
  * @param[in] TIM2_ForcedAction specifies the forced Action to be set to the output waveform.
  * This parameter can be one of the following values:
  *                       - TIM2_FORCEDACTION_ACTIVE: Force active level on OC1REF
  *                       - TIM2_FORCEDACTION_INACTIVE: Force inactive level on
  *                         OC1REF.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Force the TIM2 Channel1 output waveform to active or inactive level.
  * @code
  * TIM2_ForcedOC1Config(TIM2_FORCEDACTION_ACTIVE);
  * @endcode
  */
void TIM2_ForcedOC1Config(u8 TIM2_ForcedAction)
{
    u8 tmpccmr1 = 0;

    /* Check the parameters */
    assert_param(IS_TIM2_FORCED_ACTION_OK(TIM2_ForcedAction));

    tmpccmr1 = TIM2->CCMR1;

    /* Reset the OCM Bits */
    tmpccmr1 &= (u8)(~TIM2_CCMR_OCM);

    /* Configure The Forced output Mode */
    tmpccmr1 |= TIM2_ForcedAction;

    TIM2->CCMR1 = tmpccmr1;
}


/**
  * @brief Forces the TIM2 Channel2 output waveform to active or inactive level.
  * @param[in] TIM2_ForcedAction specifies the forced Action to be set to the output waveform.
  * This parameter can be one of the following values:
  *                       - TIM2_FORCEDACTION_ACTIVE: Force active level on OC2REF
  *                       - TIM2_FORCEDACTION_INACTIVE: Force inactive level on
  *                         OC2REF.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Force the TIM2 Channel2 output waveform to active or inactive level.
  * @code
  * TIM2_ForcedOC2Config(TIM2_FORCEDACTION_ACTIVE);
  * @endcode
  */
void TIM2_ForcedOC2Config(u8 TIM2_ForcedAction)
{
    u8 tmpccmr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM2_FORCED_ACTION_OK(TIM2_ForcedAction));

    tmpccmr2 = TIM2->CCMR2;

    /* Reset the OCM Bits */
    tmpccmr2 &= (u8)(~TIM2_CCMR_OCM);

    /* Configure The Forced output Mode */
    tmpccmr2 |= TIM2_ForcedAction;

    TIM2->CCMR2 = tmpccmr2;
}


/**
  * @brief Forces the TIM2 Channel3 output waveform to active or inactive level.
  * @param[in] TIM2_ForcedAction specifies the forced Action to be set to the output waveform.
  * This parameter can be one of the following values:
  *                       - TIM2_FORCEDACTION_ACTIVE: Force active level on OC3REF
  *                       - TIM2_FORCEDACTION_INACTIVE: Force inactive level on
  *                         OC3REF.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Force the TIM2 Channel3 output waveform to active or inactive level.
  * @code
  * TIM2_ForcedOC3Config(TIM2_FORCEDACTION_ACTIVE);
  * @endcode
  */
void TIM2_ForcedOC3Config(u8 TIM2_ForcedAction)
{
    u8 tmpccmr3 = 0;

    /* Check the parameters */
    assert_param(IS_TIM2_FORCED_ACTION_OK(TIM2_ForcedAction));

    tmpccmr3 = TIM2->CCMR3;

    /* Reset the OCM Bits */
    tmpccmr3 &= (u8)(~TIM2_CCMR_OCM);

    /* Configure The Forced output Mode */
    tmpccmr3 |= TIM2_ForcedAction;

    TIM2->CCMR3 = tmpccmr3;
}


/**
  * @brief Enables or disables TIM2 peripheral Preload register on ARR.
  * @param[in] NewState new state of the TIM2 peripheral Preload register.
  * This parameter can be ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable TIM2 peripheral Preload register on ARR.
  * @code
  * TIM2_ARRPreloadConfig(ENABLE);
  * @endcode
  */
void TIM2_ARRPreloadConfig(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONALSTATE_OK(NewState));

    /* Set or Reset the ARPE Bit */
    if (NewState == ENABLE)
    {
        TIM2->CR1 |= TIM2_CR1_ARPE ;
    }
    else
    {
        TIM2->CR1 &= (u8)(~TIM2_CR1_ARPE) ;
    }
}


/**
  * @brief Enables or disables the TIM2 peripheral Preload Register on CCR1.
  * @param[in] NewState new state of the Capture Compare Preload register.
  * This parameter can be ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable the TIM2 peripheral Preload Register on CCR1.
  * @code
  * TIM2_OC1PreloadConfig(ENABLE);
  * @endcode
  */
void TIM2_OC1PreloadConfig(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONALSTATE_OK(NewState));

    /* Set or Reset the OC1PE Bit */
    if (NewState == ENABLE)
    {
        TIM2->CCMR1 |= TIM2_CCMR_OCxPE ;
    }
    else
    {
        TIM2->CCMR1 &= (u8)(~TIM2_CCMR_OCxPE) ;
    }
}


/**
  * @brief Enables or disables the TIM2 peripheral Preload Register on CCR2.
  * @param[in] NewState new state of the Capture Compare Preload register.
  * This parameter can be ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable the TIM2 peripheral Preload Register on CCR2.
  * @code
  * TIM2_OC2PreloadConfig(ENABLE);
  * @endcode
  */
void TIM2_OC2PreloadConfig(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONALSTATE_OK(NewState));

    /* Set or Reset the OC2PE Bit */
    if (NewState == ENABLE)
    {
        TIM2->CCMR2 |= TIM2_CCMR_OCxPE ;
    }
    else
    {
        TIM2->CCMR2 &= (u8)(~TIM2_CCMR_OCxPE) ;
    }
}


/**
  * @brief Enables or disables the TIM2 peripheral Preload Register on CCR3.
  * @param[in] NewState new state of the Capture Compare Preload register.
  * This parameter can be ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable the TIM2 peripheral Preload Register on CCR3.
  * @code
  * TIM2_OC3PreloadConfig(ENABLE);
  * @endcode
  */
void TIM2_OC3PreloadConfig(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONALSTATE_OK(NewState));

