xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_tim2.c
    /* Set or Reset the OC3PE Bit */
    if (NewState == ENABLE)
    {
        TIM2->CCMR3 |= TIM2_CCMR_OCxPE ;
    }
    else
    {
        TIM2->CCMR3 &= (u8)(~TIM2_CCMR_OCxPE) ;
    }
}


/**
  * @brief Configures the TIM2 event to be generated by software.
  * @param[in] TIM2_EventSource specifies the event source.
  * This parameter can be one of the following values:
  *                       - TIM2_EVENTSOURCE_UPDATE: TIM2 update Event source
  *                       - TIM2_EVENTSOURCE_CC1: TIM2 Capture Compare 1 Event source
  *                       - TIM2_EVENTSOURCE_CC2: TIM2 Capture Compare 2 Event source
  *                       - TIM2_EVENTSOURCE_CC3: TIM2 Capture Compare 3 Event source
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Configure the TIM2 event to be generated by software.
  * @code
  * TIM2_GenerateEvent(TIM2_EVENTSOURCE_UPDATE);
  * @endcode
  */
void TIM2_GenerateEvent(u8 TIM2_EventSource)
{
    /* Check the parameters */
    assert_param(IS_TIM2_EVENT_SOURCE_OK(TIM2_EventSource));

    /* Set the event sources */
    TIM2->EGR |= TIM2_EventSource;
}


/**
  * @brief Configures the TIM2 Channel 1 polarity.
  * @param[in] TIM2_OCPolarity specifies the OC1 Polarity.
  * This parameter can be one of the following values:
  *                       - TIM2_OCPOLARITY_LOW: Output Compare active low
  *                       - TIM2_OCPOLARITY_HIGH: Output Compare active high
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Configure the TIM2 Channel 1 polarity to High.
  * @code
  * TIM2_OC1PolarityConfig(TIM2_OCPOLARITY_HIGH);
  * @endcode
  */
void TIM2_OC1PolarityConfig(u8 TIM2_OCPolarity)
{
    /* Check the parameters */
    assert_param(IS_TIM2_OC_POLARITY_OK(TIM2_OCPolarity));

    /* Set or Reset the CC1P Bit */
    if (TIM2_OCPolarity == TIM2_OCPOLARITY_LOW)
    {
        TIM2->CCER1 |= TIM2_CCER1_CC1P ;
    }
    else
    {
        TIM2->CCER1 &= (u8)(~TIM2_CCER1_CC1P) ;
    }
}


/**
  * @brief Configures the TIM2 Channel 2 polarity.
  * @param[in] TIM2_OCPolarity specifies the OC2 Polarity.
  * This parameter can be one of the following values:
  *                       - TIM2_OCPOLARITY_LOW: Output Compare active low
  *                       - TIM2_OCPOLARITY_HIGH: Output Compare active high
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Configure the TIM2 Channel 2 polarity to High.
  * @code
  * TIM2_OC2PolarityConfig(TIM2_OCPOLARITY_HIGH);
  * @endcode
  */
void TIM2_OC2PolarityConfig(u8 TIM2_OCPolarity)
{
    /* Check the parameters */
    assert_param(IS_TIM2_OC_POLARITY_OK(TIM2_OCPolarity));

    /* Set or Reset the CC2P Bit */
    if (TIM2_OCPolarity == TIM2_OCPOLARITY_LOW)
    {
        TIM2->CCER1 |= TIM2_CCER1_CC2P ;
    }
    else
    {
        TIM2->CCER1 &= (u8)(~TIM2_CCER1_CC2P) ;
    }
}


/**
  * @brief Configures the TIM2 Channel 3 polarity.
  * @param[in] TIM2_OCPolarity specifies the OC3 Polarity.
  * This parameter can be one of the following values:
  *                       - TIM2_OCPOLARITY_LOW: Output Compare active low
  *                       - TIM2_OCPOLARITY_HIGH: Output Compare active high
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Configure the TIM2 Channel 3 polarity to High.
  * @code
  * TIM2_OC3PolarityConfig(TIM2_OCPOLARITY_HIGH);
  * @endcode
  */
void TIM2_OC3PolarityConfig(u8 TIM2_OCPolarity)
{
    /* Check the parameters */
    assert_param(IS_TIM2_OC_POLARITY_OK(TIM2_OCPolarity));

    /* Set or Reset the CC3P Bit */
    if (TIM2_OCPolarity == TIM2_OCPOLARITY_LOW)
    {
        TIM2->CCER2 |= TIM2_CCER2_CC3P ;
    }
    else
    {
        TIM2->CCER2 &= (u8)(~TIM2_CCER2_CC3P) ;
    }
}


/**
  * @brief Enables or disables the TIM2 Capture Compare Channel x.
  * @param[in] TIM2_Channel specifies the TIM2 Channel.
  * This parameter can be one of the following values:
  *                       - TIM2_Channel1: TIM2 Channel1
  *                       - TIM2_Channel2: TIM2 Channel2
  *                       - TIM2_Channel3: TIM2 Channel3
  * @param[in] NewState specifies the TIM2 Channel CCxE bit new state.
  * This parameter can be: ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable the TIM2 Capture Compare Channel 1.
  * @code
  * TIM2_CCxCmd(TIM2_Channel1, ENABLE);
  * @endcode
  */
void TIM2_CCxCmd(u8 TIM2_Channel, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_TIM2_CHANNEL_OK(TIM2_Channel));
    assert_param(IS_FUNCTIONALSTATE_OK(NewState));

    if (TIM2_Channel == TIM2_CHANNEL_1)
    {
        /* Set or Reset the CC1E Bit */
        if (NewState == ENABLE)
        {
            TIM2->CCER1 |= TIM2_CCER1_CC1E ;
        }
        else
        {
            TIM2->CCER1 &= (u8)(~TIM2_CCER1_CC1E) ;
        }

    }
    else if (TIM2_Channel == TIM2_CHANNEL_2)
    {
        /* Set or Reset the CC2E Bit */
        if (NewState == ENABLE)
        {
            TIM2->CCER1 |= TIM2_CCER1_CC2E;
        }
        else
        {
            TIM2->CCER1 &= (u8)(~TIM2_CCER1_CC2E) ;
        }
    }
    else
    {
        /* Set or Reset the CC3E Bit */
        if (NewState == ENABLE)
        {
            TIM2->CCER2 |= TIM2_CCER2_CC3E;
        }
        else
        {
            TIM2->CCER2 &= (u8)(~TIM2_CCER2_CC3E) ;
        }
    }
}

/**
  * @brief Selects the TIM2 Ouput Compare Mode. This function disables the
  * selected channel before changing the Ouput Compare Mode. User has to
  * enable this channel using TIM2_CCxCmd and TIM2_CCxNCmd functions.
  * @param[in] TIM2_Channel specifies the TIM2 Channel.
  * This parameter can be one of the following values:
  *                       - TIM2_Channel1: TIM2 Channel1
  *                       - TIM2_Channel2: TIM2 Channel2
  *                       - TIM2_Channel3: TIM2 Channel3
  * @param[in] TIM2_OCMode specifies the TIM2 Output Compare Mode.
  * This paramter can be one of the following values:
  *                       - TIM2_OCMODE_TIMING
  *                       - TIM2_OCMODE_ACTIVE
  *                       - TIM2_OCMODE_TOGGLE
  *                       - TIM2_OCMODE_PWM1
  *                       - TIM2_OCMODE_PWM2
  *                       - TIM2_FORCEDACTION_ACTIVE
  *                       - TIM2_FORCEDACTION_INACTIVE
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Selects the TIM2 Ouput Compare Mode TIM2_OCMODE_TIMING for channel1.
  * @code
  * TIM2_SelectOCxM(TIM2_Channel1, TIM2_OCMODE_TIMING);
  * @endcode
  */
void TIM2_SelectOCxM(u8 TIM2_Channel, u8 TIM2_OCMode)
{
    /* Check the parameters */
    assert_param(IS_TIM2_CHANNEL_OK(TIM2_Channel));
    assert_param(IS_TIM2_OCM_OK(TIM2_OCMode));

