xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_tim2.c
    if (TIM2_Channel == TIM2_CHANNEL_1)
    {
        /* Disable the Channel 1: Reset the CCE Bit */
        TIM2->CCER1 &= (u8)(~TIM2_CCER1_CC1E);

        /* Reset the Output Compare Bits */
        TIM2->CCMR1 &= (u8)(~TIM2_CCMR_OCM);

        /* Set the Ouput Compare Mode */
        TIM2->CCMR1 |= TIM2_OCMode;
    }
    else if (TIM2_Channel == TIM2_CHANNEL_2)
    {
        /* Disable the Channel 2: Reset the CCE Bit */
        TIM2->CCER1 &= (u8)(~TIM2_CCER1_CC2E);

        /* Reset the Output Compare Bits */
        TIM2->CCMR2 &= (u8)(~TIM2_CCMR_OCM);

        /* Set the Ouput Compare Mode */
        TIM2->CCMR2 |= TIM2_OCMode;
    }
    else
    {
        /* Disable the Channel 3: Reset the CCE Bit */
        TIM2->CCER2 &= (u8)(~TIM2_CCER2_CC3E);

        /* Reset the Output Compare Bits */
        TIM2->CCMR3 &= (u8)(~TIM2_CCMR_OCM);

        /* Set the Ouput Compare Mode */
        TIM2->CCMR3 |= TIM2_OCMode;
    }
}


/**
  * @brief Sets the TIM2 Counter Register value.
  * @param[in] Counter specifies the Counter register new value.
  * This parameter is between 0x0000 and 0xFFFF.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Set the TIM2 Counter Register value to 0xFFEE.
  * @code
  * TIM2_SetCounter(0xFFEE);
  * @endcode
  */
void TIM2_SetCounter(u16 Counter)
{
    /* Set the Counter Register value */
    TIM2->CNTRH = (u8)(Counter >> 8);
	TIM2->CNTRL = (u8)(Counter);
    
}


/**
  * @brief Sets the TIM2 Autoreload Register value.
  * @param[in] Autoreload specifies the Autoreload register new value.
  * This parameter is between 0x0000 and 0xFFFF.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Set the TIM2 Autoreload Register value to 0xFFEE.
  * @code
  * TIM2_SetAutoreload(0xFFEE);
  * @endcode
  */
void TIM2_SetAutoreload(u16 Autoreload)
{

    /* Set the Autoreload Register value */
    TIM2->ARRH = (u8)(Autoreload >> 8);
	TIM2->ARRL = (u8)(Autoreload);
    
}


/**
  * @brief Sets the TIM2 Capture Compare1 Register value.
  * @param[in] Compare1 specifies the Capture Compare1 register new value.
  * This parameter is between 0x0000 and 0xFFFF.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Set the TIM2 Capture Compare1 Register value to 0xFFEE.
  * @code
  * TIM2_SetCompare1(0xFFEE);
  * @endcode
  */
void TIM2_SetCompare1(u16 Compare1)
{
    /* Set the Capture Compare1 Register value */
    TIM2->CCR1H = (u8)(Compare1 >> 8);
	TIM2->CCR1L = (u8)(Compare1);
    
}


/**
  * @brief Sets the TIM2 Capture Compare2 Register value.
  * @param[in] Compare2 specifies the Capture Compare2 register new value.
  * This parameter is between 0x0000 and 0xFFFF.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Set the TIM2 Capture Compare2 Register value to 0xFFEE.
  * @code
  * TIM2_SetCompare2(0xFFEE);
  * @endcode
  */
void TIM2_SetCompare2(u16 Compare2)
{
    /* Set the Capture Compare2 Register value */
    TIM2->CCR2H = (u8)(Compare2 >> 8);
	TIM2->CCR2L = (u8)(Compare2);
    
}


/**
  * @brief Sets the TIM2 Capture Compare3 Register value.
  * @param[in] Compare3 specifies the Capture Compare3 register new value.
  * This parameter is between 0x0000 and 0xFFFF.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Set the TIM2 Capture Compare3 Register value to 0xFFEE.
  * @code
  * TIM2_SetCompare3(0xFFEE);
  * @endcode
  */
void TIM2_SetCompare3(u16 Compare3)
{
    /* Set the Capture Compare3 Register value */
    TIM2->CCR3H = (u8)(Compare3 >> 8);
	TIM2->CCR3L = (u8)(Compare3);
    
}


/**
  * @brief Sets the TIM2 Input Capture 1 prescaler.
  * @param[in] TIM2_IC1Prescaler specifies the Input Capture prescaler new value
  * This parameter can be one of the following values:
  *                       - TIM2_ICPSC_DIV1: no prescaler
  *                       - TIM2_ICPSC_DIV2: capture is done once every 2 events
  *                       - TIM2_ICPSC_DIV4: capture is done once every 4 events
  *                       - TIM2_ICPSC_DIV8: capture is done once every 8 events
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Set the TIM2 Input Capture 1 prescaler to do a capture every 8 events.
  * @code
  * TIM2_SetIC1Prescaler(TIM2_ICPSC_DIV8);
  * @endcode
  */
void TIM2_SetIC1Prescaler(u8 TIM2_IC1Prescaler)
{
    u8 tmpccmr1 = 0;

    /* Check the parameters */
    assert_param(IS_TIM2_IC_PRESCALER_OK(TIM2_IC1Prescaler));

    tmpccmr1 = TIM2->CCMR1;

    /* Reset the IC1PSC Bits */
    tmpccmr1 &= (u8)(~TIM2_CCMR_ICxPSC);

    /* Set the IC1PSC value */
    tmpccmr1 |= TIM2_IC1Prescaler;

    TIM2->CCMR1 = tmpccmr1;
}

/**
  * @brief Sets the TIM2 Input Capture 2 prescaler.
  * @param[in] TIM2_IC2Prescaler specifies the Input Capture prescaler new value
  * This parameter can be one of the following values:
  *                       - TIM2_ICPSC_DIV1: no prescaler
  *                       - TIM2_ICPSC_DIV2: capture is done once every 2 events
  *                       - TIM2_ICPSC_DIV4: capture is done once every 4 events
  *                       - TIM2_ICPSC_DIV8: capture is done once every 8 events
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Set the TIM2 Input Capture 2 prescaler to do a capture every 8 events.
  * @code
  * TIM2_SetIC2Prescaler(TIM2_ICPSC_DIV8);
  * @endcode
  */
void TIM2_SetIC2Prescaler(u8 TIM2_IC2Prescaler)
{
    u8 tmpccmr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM2_IC_PRESCALER_OK(TIM2_IC2Prescaler));

    tmpccmr2 = TIM2->CCMR2;

    /* Reset the IC2PSC Bits */
    tmpccmr2 &= (u8)(~TIM2_CCMR_ICxPSC);

    /* Set the IC2PSC value */
    tmpccmr2 |= TIM2_IC2Prescaler;

