xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_tim2.c
    TIM2->CCMR2 = tmpccmr2;
}

/**
  * @brief Sets the TIM2 Input Capture 3 prescaler.
  * @param[in] TIM2_IC3Prescaler specifies the Input Capture prescaler new value
  * This parameter can be one of the following values:
  *                       - TIM2_ICPSC_DIV1: no prescaler
  *                       - TIM2_ICPSC_DIV2: capture is done once every 2 events
  *                       - TIM2_ICPSC_DIV4: capture is done once every 4 events
  *                       - TIM2_ICPSC_DIV8: capture is done once every 8 events
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Set the TIM2 Input Capture 3 prescaler to do a capture every 8 events.
  * @code
  * TIM2_SetIC3Prescaler(TIM2_ICPSC_DIV8);
  * @endcode
  */
void TIM2_SetIC3Prescaler(u8 TIM2_IC3Prescaler)
{
    u8 tmpccmr3 = 0;

    /* Check the parameters */
    assert_param(IS_TIM2_IC_PRESCALER_OK(TIM2_IC3Prescaler));

    tmpccmr3 = TIM2->CCMR3;

    /* Reset the IC3PSC Bits */
    tmpccmr3 &= (u8)(~TIM2_CCMR_ICxPSC);

    /* Set the IC3PSC value */
    tmpccmr3  |= TIM2_IC3Prescaler;

    TIM2->CCMR3 = tmpccmr3;
}

/**
  * @brief Gets the TIM2 Input Capture 1 value.
  * @param[in] :
  * None
  * @retval Capture Compare 1 Register value.
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Get the TIM2 Input Capture 1 value.
  * @code
  * u16 Value;
  * Value = TIM2_GetCapture1();
  * @endcode
  */
u16 TIM2_GetCapture1(void)
{
    u16 tmpccr1=0;
    u8 tmpccr1l, tmpccr1h;

    tmpccr1h = TIM2->CCR1H;
	tmpccr1l = TIM2->CCR1L;
    

    tmpccr1 = (u16)(tmpccr1l);
    tmpccr1 |= (u16)((u16)(tmpccr1h) << 8);
    /* Get the Capture 1 Register value */
    return tmpccr1;
}

/**
  * @brief Gets the TIM2 Input Capture 2 value.
  * @param[in] :
  * None
  * @retval Capture Compare 2 Register value.
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Get the TIM2 Input Capture 2 value.
  * @code
  * u16 Value;
  * Value = TIM2_GetCapture2();
  * @endcode
  */
u16 TIM2_GetCapture2(void)
{
    u16 tmpccr2=0;
    u8 tmpccr2l, tmpccr2h;

    
    tmpccr2h = TIM2->CCR2H;
	tmpccr2l = TIM2->CCR2L;

    tmpccr2 = (u16)(tmpccr2l);
    tmpccr2 |= (u16)((u16)(tmpccr2h) << 8);
    /* Get the Capture 2 Register value */
    return tmpccr2;
}

/**
  * @brief Gets the TIM2 Input Capture 3 value.
  * @param[in] :
  * None
  * @retval Capture Compare 3 Register value.
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Get the TIM2 Input Capture 3 value.
  * @code
  * u16 Value;
  * Value = TIM2_GetCapture3();
  * @endcode
  */
u16 TIM2_GetCapture3(void)
{
    u16 tmpccr3=0;
    u8 tmpccr3l, tmpccr3h;

    
    tmpccr3h = TIM2->CCR3H;
	tmpccr3l = TIM2->CCR3L;

    tmpccr3 = (u16)(tmpccr3l);
    tmpccr3 |= (u16)((u16)(tmpccr3h) << 8);
    /* Get the Capture 3 Register value */
    return tmpccr3;
}

/**
  * @brief Gets the TIM2 Counter value.
  * @param[in] :
  * None
  * @retval Counter Register value.
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Get the TIM2 Counter value.
  * @code
  * u16 Value;
  * Value = TIM2_GetCounter();
  * @endcode
  */
u16 TIM2_GetCounter(void)
{
    u16 tmpcnt=0;
    u8 tmpcntrl, tmpcntrh;

    tmpcntrh = TIM2->CNTRH;
	tmpcntrl = TIM2->CNTRL;

    tmpcnt = (u16)(tmpcntrl);
    tmpcnt |= (u16)((u16)(tmpcntrh) << 8);
    /* Get the Counter Register value */
    return tmpcnt;
}


/**
  * @brief Gets the TIM2 Prescaler value.
  * @param[in] :
  * None
  * @retval Prescaler Register configuration value.
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Get the TIM2 Prescaler configurartion value.
  * @code
  * u8  Prescaler;
  * Prescaler = TIM2_GetPrescaler();
  * @endcode
  */
u8 TIM2_GetPrescaler(void)
{
    u8 tmppscr;

    tmppscr = TIM2->PSCR;

    /* Get the Prescaler Register value */
    return tmppscr;
}


/**
  * @brief Checks whether the specified TIM2 flag is set or not.
  * @param[in] TIM2_FLAG specifies the flag to check.
  * This parameter can be one of the following values:
  *                       - TIM2_FLAG_UPDATE: TIM2 update Flag
  *                       - TIM2_FLAG_CC1: TIM2 Capture Compare 1 Flag
  *                       - TIM2_FLAG_CC2: TIM2 Capture Compare 2 Flag
  *                       - TIM2_FLAG_CC3: TIM2 Capture Compare 3 Flag
  *                       - TIM2_FLAG_CC1OF: TIM2 Capture Compare 1 overcapture Flag
  *                       - TIM2_FLAG_CC2OF: TIM2 Capture Compare 2 overcapture Flag
  *                       - TIM2_FLAG_CC3OF: TIM2 Capture Compare 3 overcapture Flag
  * @retval FlagStatus The new state of TIM2_FLAG (SET or RESET).
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Check whether the TIM2_FLAG_UPDATE flag is set or not.
  * @code
  * FlagStatus FlagValue;
  * FlagValue = TIM2_GetFlagStatus(TIM2_FLAG_Update);
  * @endcode
  */
FlagStatus TIM2_GetFlagStatus(u16 TIM2_FLAG)
{
    FlagStatus bitstatus = RESET;
    u8 tim2_flag_l, tim2_flag_h;

    /* Check the parameters */
    assert_param(IS_TIM2_GET_FLAG_OK(TIM2_FLAG));

    tim2_flag_l= (u8)(TIM2_FLAG);
    tim2_flag_h= (u8)(TIM2_FLAG >> 8);

    if (((TIM2->SR1 & tim2_flag_l)|(TIM2->SR2 & tim2_flag_h)) != (u8)RESET )
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}


/**
  * @brief Clears the TIM2’s pending flags.
  * @param[in] TIM2_FLAG specifies the flag to clear.
  * This parameter can be one of the following values:
  *                       - TIM2_FLAG_UPDATE: TIM2 update Flag
  *                       - TIM2_FLAG_CC1: TIM2 Capture Compare 1 Flag
  *                       - TIM2_FLAG_CC2: TIM2 Capture Compare 2 Flag
  *                       - TIM2_FLAG_CC3: TIM2 Capture Compare 3 Flag
  *                       - TIM2_FLAG_CC1OF: TIM2 Capture Compare 1 overcapture Flag
  *                       - TIM2_FLAG_CC2OF: TIM2 Capture Compare 2 overcapture Flag
  *                       - TIM2_FLAG_CC3OF: TIM2 Capture Compare 3 overcapture Flag
  * @retval void None.
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Clear the TIM2_FLAG_UPDATE flag.
  * @code
  * TIM2_ClearFlag(TIM2_FLAG_Update);
  * @endcode
  */
void TIM2_ClearFlag(u16 TIM2_FLAG)
{
    u8 tim2_flag_l, tim2_flag_h;
    /* Check the parameters */
    assert_param(IS_TIM2_CLEAR_FLAG_OK(TIM2_FLAG));

    tim2_flag_l= (u8)(TIM2_FLAG);
    tim2_flag_h= (u8)(TIM2_FLAG >> 8);
    /* Clear the flags (rc_w0) clear this bit by writing 0. Writing ‘1’ has no effect*/
    TIM2->SR1 &= (u8)(~tim2_flag_l);
    TIM2->SR2 &= (u8)(~tim2_flag_h);
}


/**
  * @brief Checks whether the TIM2 interrupt has occurred or not.
  * @param[in] TIM2_IT specifies the TIM2 interrupt source to check.
  * This parameter can be one of the following values:
  *                       - TIM2_IT_UPDATE: TIM2 update Interrupt source
  *                       - TIM2_IT_CC1: TIM2 Capture Compare 1 Interrupt source
  *                       - TIM2_IT_CC2: TIM2 Capture Compare 2 Interrupt source
  *                       - TIM2_IT_CC3: TIM2 Capture Compare 3 Interrupt source
  * @retval ITStatus The new state of the TIM2_IT(SET or RESET).
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Check whether the TIM2_IT_UPDATE interrupt has occurred or not.
  * @code
  * ITStatus ITValue;
  * ITValue = TIM2_GetITStatus(TIM2_FLAG_Update);
  * @endcode
  */

