xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_tim2.c
ITStatus TIM2_GetITStatus(u8 TIM2_IT)
{
    ITStatus bitstatus = RESET;

    u8 TIM2_itStatus = 0x0, TIM2_itEnable = 0x0;

    /* Check the parameters */
    assert_param(IS_TIM2_GET_IT_OK(TIM2_IT));

    TIM2_itStatus = (u8)(TIM2->SR1 & TIM2_IT);

    TIM2_itEnable = (u8)(TIM2->IER & TIM2_IT);

    if ((TIM2_itStatus != (u8)RESET ) && (TIM2_itEnable != (u8)RESET ))
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}


/**
  * @brief Clears the TIM2's interrupt pending bits.
  * @param[in] TIM2_IT specifies the pending bit to clear.
  * This parameter can be one of the following values:
  *                       - TIM2_IT_UPDATE: TIM2 update Interrupt source
  *                       - TIM2_IT_CC1: TIM2 Capture Compare 1 Interrupt source
  *                       - TIM2_IT_CC2: TIM2 Capture Compare 2 Interrupt source
  *                       - TIM2_IT_CC3: TIM2 Capture Compare 3 Interrupt source
  * @retval void None.
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Clear the TIM2_IT_UPDATE interrupt pending bit.
  * @code
  * TIM2_ClearITPendingBit(TIM2_IT_Update);
  * @endcode
  */
void TIM2_ClearITPendingBit(u8 TIM2_IT)
{
    /* Check the parameters */
    assert_param(IS_TIM2_IT_OK(TIM2_IT));

    /* Clear the IT pending Bit */
    TIM2->SR1 &= (u8)(~TIM2_IT);
}


/**
  * @brief Configure the TI1 as Input.
  * @param[in] TIM2_ICPolarity  The Input Polarity.
  * This parameter can be one of the following values:
  *                       - TIM2_ICPOLARITY_FALLING
  *                       - TIM2_ICPOLARITY_RISING
  * @param[in] TIM2_ICSelection specifies the input to be used.
  * This parameter can be one of the following values:
  *                       - TIM2_ICSELECTION_DIRECTTI: TIM2 Input 1 is selected to
  *                         be connected to IC1.
  *                       - TIM2_ICSELECTION_INDIRECTTI: TIM2 Input 1 is selected to
  *                         be connected to IC2.
  * @param[in] TIM2_ICFilter Specifies the Input Capture Filter.
  * This parameter must be a value between 0x00 and 0x0F.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Configure the TI1 as Input selected to be connected to IC1 with Rising Polarity and 0x0E as Filter value.
  * @code
  * TI1_Config(TIM2_ICPOLARITY_RISING, TIM2_ICSELECTION_DIRECTTI,0x0E);
  * @endcode
  */
static void TI1_Config(u8 TIM2_ICPolarity, u8 TIM2_ICSelection,
                       u8 TIM2_ICFilter)
{
    u8 tmpccmr1 = 0;
    u8 tmpicpolarity = TIM2_ICPolarity;
    tmpccmr1 = TIM2->CCMR1;

    /* Disable the Channel 1: Reset the CCE Bit */
    TIM2->CCER1 &= (u8)(~TIM2_CCER1_CC1E);

    /* Select the Input and set the filter */
    tmpccmr1 &= (u8)(~TIM2_CCMR_CCxS) & (u8)(~TIM2_CCMR_ICxF);
    tmpccmr1 |= (u8)(((u8)(TIM2_ICSelection)) | ((u8)(TIM2_ICFilter << 4)));

    TIM2->CCMR1 = tmpccmr1;


    /* Select the Polarity */
    if (tmpicpolarity == TIM2_ICPOLARITY_FALLING)
    {
        TIM2->CCER1 |= TIM2_CCER1_CC1P ;
    }
    else
    {
        TIM2->CCER1 &= (u8)(~TIM2_CCER1_CC1P) ;
    }

    /* Set the CCE Bit */
    TIM2->CCER1 |=  TIM2_CCER1_CC1E;
}


/**
  * @brief Configure the TI2 as Input.
  * @param[in] TIM2_ICPolarity  The Input Polarity.
  * This parameter can be one of the following values:
  *                       - TIM2_ICPOLARITY_FALLING
  *                       - TIM2_ICPOLARITY_RISING
  * @param[in] TIM2_ICSelection specifies the input to be used.
  * This parameter can be one of the following values:
  *                       - TIM2_ICSELECTION_DIRECTTI: TIM2 Input 2 is selected to
  *                         be connected to IC2.
  *                       - TIM2_ICSELECTION_INDIRECTTI: TIM2 Input 2 is selected to
  *                         be connected to IC1.
  * @param[in] TIM2_ICFilter Specifies the Input Capture Filter.
  * This parameter must be a value between 0x00 and 0x0F.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * * Configure the TI2 as Input selected to be connected to IC2 with Rising Polarity and 0x0E as Filter value.
  * @code
  * TI2_Config(TIM2_ICPOLARITY_RISING, TIM2_ICSELECTION_DIRECTTI,0x0E);
  * @endcode
  */
static void TI2_Config(u8 TIM2_ICPolarity, u8 TIM2_ICSelection,
                       u8 TIM2_ICFilter)
{
    u8 tmpccmr2 = 0;
    u8 tmpicpolarity = TIM2_ICPolarity;

    tmpccmr2 = TIM2->CCMR2;

    /* Disable the Channel 2: Reset the CCE Bit */
    TIM2->CCER1 &=  (u8)(~TIM2_CCER1_CC2E);

    /* Select the Input and set the filter */
    tmpccmr2 &= (u8)(~TIM2_CCMR_CCxS) & (u8)(~TIM2_CCMR_ICxF);
    tmpccmr2 |= (u8)(((u8)(TIM2_ICSelection)) | ((u8)(TIM2_ICFilter << 4)));

    TIM2->CCMR2 = tmpccmr2;

    /* Select the Polarity */
    if (tmpicpolarity == TIM2_ICPOLARITY_FALLING)
    {
        TIM2->CCER1 |= TIM2_CCER1_CC2P ;
    }
    else
    {
        TIM2->CCER1 &= (u8)(~TIM2_CCER1_CC2P) ;
    }

    /* Set the CCE Bit */
    TIM2->CCER1 |=  TIM2_CCER1_CC2E;

}

/**
  * @brief Configure the TI3 as Input.
  * @param[in] TIM2_ICPolarity  The Input Polarity.
  * This parameter can be one of the following values:
  *                       - TIM2_ICPOLARITY_FALLING
  *                       - TIM2_ICPOLARITY_RISING
  * @param[in] TIM2_ICSelection specifies the input to be used.
  * This parameter can be one of the following values:
  *                       - TIM2_ICSELECTION_DIRECTTI: TIM2 Input 3 is selected to
  *                         be connected to IC3.
  * @param[in] TIM2_ICFilter Specifies the Input Capture Filter.
  * This parameter must be a value between 0x00 and 0x0F.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * * Configure the TI3 as Input selected to be connected to IC3 with Rising Polarity and 0x0E as Filter value.
  * @code
  * TI3_Config(TIM2_ICPOLARITY_RISING, TIM2_ICSELECTION_DIRECTTI,0x0E);
  * @endcode
  */
static void TI3_Config(u8 TIM2_ICPolarity, u8 TIM2_ICSelection,
                       u8 TIM2_ICFilter)
{

    u8 tmpccmr3 = 0;
    u8 tmpicpolarity = TIM2_ICPolarity;

    assert_param(IS_TIM2_IC_SELECTION1_OK(TIM2_ICSelection));


    tmpccmr3 = TIM2->CCMR3;

    /* Disable the Channel 3: Reset the CCE Bit */
    TIM2->CCER2 &=  (u8)(~TIM2_CCER2_CC3E);

    /* Select the Input and set the filter */
    tmpccmr3 &= (u8)(~TIM2_CCMR_CCxS) & (u8)(~TIM2_CCMR_ICxF);
    tmpccmr3 |= (u8)(((u8)(TIM2_ICSelection)) | ((u8)(TIM2_ICFilter << 4)));

    TIM2->CCMR3 = tmpccmr3;

    /* Select the Polarity */
    if (tmpicpolarity == TIM2_ICPOLARITY_FALLING)
    {
        TIM2->CCER2 |= TIM2_CCER2_CC3P ;
    }
    else
    {
        TIM2->CCER2 &= (u8)(~TIM2_CCER2_CC3P) ;
    }
    /* Set the CCE Bit */
    TIM2->CCER2 |=  TIM2_CCER2_CC3E;
}
/**
  * @}
  */
/******************* (C) COPYRIGHT 2007 STMicroelectronics *****END OF FILE****/
